<script>
import HeaderList from './HeaderList.vue';
import SectionFooter from './SectionFooter.vue';

const sectionName = "faq";
export default {
  components: { HeaderList, SectionFooter },
  data() {
    return {
        sectionName,
        litem: [
            {txt: "Я ТОЧНО ВСЕМУ НАУЧУСЬ? У МЕНЯ ПОЛУЧИТСЯ?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "КАК Я БУДУ УЧИТЬСЯ СКОРОСТНОМУ НАРАЩИВАНИЮ ОНЛАЙН?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "СКОЛЬКО ВРЕМЕНИ БУДЕТ УХОДИТЬ НА ВЫПОЛНЕНИЕ ДЗ?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "КАК ЧАСТО БУДУТ ВЫХОДИТЬ УРОКИ?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "КАКАЯ ТЕХНИКА БУДЕТ ОТРАБАТЫВАТЬСЯ: РУЧНАЯ ИЛИ ЛЕНТОЧНАЯ?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
        ],
    }
    }
}

</script>
<template>
    <section class="faq">
        <div class="container">
            <h2>А ТАКИЕ ВОПРОСЫ МОГУТ БЫТЬ У ВАС</h2>
            <HeaderList :litem="litem" :sectionName="sectionName"/>
            <SectionFooter :sectionName = "sectionName" txt="У ВАС ЕСТЬ ДРУГОЙ ВОПРОС? НАПИШИТЕ МНЕ В ТЕЛЕГРАМ"/>
        </div>
    </section>
</template>
<style scoped lang="sass">

.faq
    padding-top: 11.5rem

</style>