<script>
import HeaderList from './HeaderList.vue';
import Img from './Img.vue';
import SectionFooter from './SectionFooter.vue';
const format ="svg";
const sectionName = "programm";
export default {
  components: { HeaderList, Img, SectionFooter },
  data() {
    return {
        sectionName,
        markSheme: " +",
        litem: [
            {txt: "ВВОДНЫЙ УРОК", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "СКОРОСТНОЕ СНЯТИЕ РЕСНИЦ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "РАБОТА С КЛЕЕМ. КАК ПРОДЛИТЬ НОСКУ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "ЗДОРОВЬЕ МАСТЕРА", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "ЛИЧНЫЙ БРЕНД В INSTAGRAM: ПОЧЕМУ УВЯДАЮТ КОММЕРЧЕСКИЕ АККАУНТЫ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "ЛОМАЕМ СТЕРЕОТИПЫ МОДЕЛИРОВАНИЯ: ЧЕМ СЛОЖНЕЕ ПРИДУМАЛ, ТЕМ СЛОЖНЕЕ ЖИТЬ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "КЛАССИЧЕСКОЕ НАРАЩИВАНИЕ РЕСНИЦ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "ПУЧОК. КАК БЫСТРО И ПРАВИЛЬНО ФОРМИРОВАТЬ ТЕБЯ, ДРУЖОК?", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."},
            {txt: "НАРАЩИВАЕМ ОБЪЕМЫ 2D+ ", details: "Давай посмотрим правде в глаза: никто не рождается с кисточкой в руках и идеальным наращиванием ресниц. Все начинается с желания, с усилий, с практики. Я точно знаю, что ты способна на большее, чем ты себе представляешь.  Я буду рядом, чтобы тебя поддерживать, делиться опытом, показывать новые фишки, разбирать твои ошибки (да-да, они будут, но они же и научат!)."}
        ],
    }
    },
    computed: {
    textWithParagraph() {
      return `${sectionName} <p>рыба</p>`;
    },
  },
}
</script>
<template>
    <section :class="sectionName">
        <div class="container">
            <h2>ВОТ ТАКАЯ ПРОГРАММА ИНТЕНСИВА</h2>
            <div v-html="htmlText"></div>
            <HeaderList :litem="litem" :markSheme="markSheme" :sectionName="sectionName"/>
            <SectionFooter :sectionName = "sectionName" txt="Все еще думаешь? <p>А места разбирают уже сейчас</p>" />
        </div>
    </section>
</template>
<style scoped lang="sass">
.list
    width: 100%
    flex-direction: column

.programm__section-footer form
  order: -1

</style>